Release/tests/battery/ab.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        battery-http-server
Server Hostname:        localhost
Server Port:            8080

Document Path:          /index.html
Document Length:        9 bytes

Concurrency Level:      50
Time taken for tests:   1.858 seconds
Complete requests:      10000
Failed requests:        0
Write errors:           0
Keep-Alive requests:    10000
Total transferred:      2420000 bytes
HTML transferred:       90000 bytes
Requests per second:    5381.82 [#/sec] (mean)
Time per request:       9.291 [ms] (mean)
Time per request:       0.186 [ms] (mean, across all concurrent requests)
Transfer rate:          1271.88 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0      21
Processing:     1    9   1.4      9      32
Waiting:        1    9   1.4      9      32
Total:          1    9   1.5      9      53

Percentage of the requests served within a certain time (ms)
  50%      9
  66%      9
  75%      9
  80%      9
  90%     10
  95%     10
  98%     13
  99%     17
 100%     53 (longest request)